{
  "homeLink": "О нас",
  "loginLink": "Вход",
  "signupLink": "Регистрация",
  "signoutLink": "Выход",
  "mainLink": "Перейти на главную страницу",
  "workLink": "Главная",
  "emailPlaceholder": "Адрес почты",
  "emailWarning": "Введите почту!",
  "emailWarning2" : "Невалидный адрес почты!",
  "passwordPlaceholder": "Пароль",
  "passwordWarning": "Вы должны указать пароль!",
  "passwordWarning2": "Пароль должен содержать минимум одно число и один специальный символ",
  "passwordWarning3": "Пароль должен быть длиннее 8 символов",
  "passwordWarning4": "Пароль должен быть меньше 20 символов",
  "forgotPassword": "Забыли пароль",
  "registerText": "Нет акканута?",
  "registerText2": "Зарегистрируйтесь",
  "registerText3": "сейчас.",
  "registerText4": "Уже есть аккаунт?",
  "namePlaceholder": "Введите имя",
  "nameWarning": "Введите имя!",
  "nameWarning2": "Имя должно быть длиннее 4 символов",
  "resetText": "Восстановить пароль",
  "resetText2": "Пожалуйста проверьте почту для сброса пароля.",
  "resetText3": "Войти",
  "aboutTeam": "О команде",
  "aboutProject": "О проекте",
  "aboutCourse": "О курсе",
  "amina": "Амина Сенченко",
  "artem": "Артем Сюзев",
  "yevheniia": "Евгения Минюкова",
  "aminaDescription": "Студентка из Алматы по специальности Информационные системы. Окончила поток 2022Q3 в Rolling Scopes School. В данном проекте выступала в роли тимлида, реализовала роутинг, авторизацию, локализацию, также занималась настройкой и сборкой проекта, доработкой конечного результата.",
  "artemDescription": "Ранее окончил основной курс RS School Frontend JavaScript. В данном проекте реализовал главную страницу за исключением блока документации, взаимодействие с API, базовую настройку управления проектом на основе GitHub Projects. Находился в окружении замечательных коллег :)",
  "yevheniiaDescription": "Родом из Харькова, есть высшее финансовое образование, четыре года работала в бухгалтерии банка. Студент RS School с лета 2022 года и окончила 0, 1 и 2 этапы JS курса. В данном проекте реализовала хедер, футер, страницу о нас, блок с документацией, получение схемы API, базовые стили.",
  "aboutProjectText": "Данное приложение разработано на React, TypeScript, Redux с использованием дополнительных библиотек и ресурсов, таких как Redux Toolkit, Firebase, i18next, Codemirror и PrimeReact, и является игровой площадкой / IDE для запросов к Countries GraphQL API. Оно локализовано на два языка и полностью адаптивно (до 320 пикселей), с отзывчивой версткой. Для того чтобы воспользоваться приложением, вам необходимо авторизоваться и перейти на главную страницу. Она состоит из нескольких частей, таких как блок документации с описанием схемы API, блок для создания запроса с возможностью открытия нескольких рабочих вкладок, блок для переменных и заголовков и, наконец, блок для вывода результата в формате JSON.",
  "aboutCourseText": "Курс React от Rolling Scopes School — это комплексная программа, которая предоставляет материалы и задания, необходимые для овладения данным фреймворком. Студенты изучают такие концепции, как компоненты, управление состоянием и методы жизненного цикла, а также продвинутые темы: React Router, Redux и hooks. Учебная программа сочетает теорию и практику с интересными задачами и уникальной системой проверки. К концу курса студенты обладают опытом разработки динамических и масштабируемых веб-приложений с использованием React, достаточным для работы в качестве junior разработчика. Узнайте больше на странице курса ",
  "errorBoundary": "Извините, что-то пошло не так. Пожалуйста, перезагрузите страницу или попробуйте через несколько минут!"
}
