{
  "homeLink": "Welcome",
  "loginLink": "Sign In",
  "signupLink": "Sign Up",
  "signoutLink": "Sign Out",
  "mainLink": "Go to Main Page",
  "workLink": "Main",
  "emailPlaceholder": "Email address",
  "emailWarning": "Email is Required!",
  "emailWarning2" : "Invalid email address",
  "passwordPlaceholder": "Password",
  "passwordWarning": "You must specify a password!",
  "passwordWarning2": "Password should contain at least one number and one special character",
  "passwordWarning3": "Password must be more than 8 characters",
  "passwordWarning4": "Password must be less than 20 characters",
  "forgotPassword": "Forgot Password",
  "registerText": "Don't have an account?",
  "registerText2": "Register",
  "registerText3": "now.",
  "registerText4": "Already have an account?",
  "namePlaceholder": "Enter name",
  "nameWarning": "Fullname is Required!",
  "nameWarning2": "Name must be longer than 4 symbols",
  "resetText": "Reset password",
  "resetText2": "Please check your email to reset password.",
  "resetText3": "Sign In",
  "aboutTeam": "About team",
  "aboutProject": "About project",
  "aboutCourse": "About course",
  "amina": "Amina Senchenko",
  "artem": "Artem Siuzev",
  "yevheniia": "Yevheniia Miniukova",
  "aminaDescription": "A student from Almaty majoring in Information Systems. Graduated from the 2022Q3 set at Rolling Scopes School. In this project, acted as a team leader, implemented routing, authorization, localization, also engaged in setting up and assembling the project, finalizing the final result.",
  "artemDescription": "Previously, graduated from the RS School Frontend JavaScript basic course. In this project, implemented the main page with the exception of the documentation block, interaction with the API, the basic configuration of project management based on GitHub Projects. Was surrounded by wonderful colleagues :)",
  "yevheniiaDescription": "From Kharkiv, has a higher financial education, worked for four years in the accounting department of the bank. A student of RS School since the summer of 2022 and graduated from the 0, 1 and 2 stages of the JS course. In this project, implemented a header, a footer, a page about us, a block with documentation, getting an API schema, basic styles.",
  "aboutProjectText": "This project is developed on React, TypeScript, Redux using additional libraries and resources such as Redux Toolkit, Firebase, i18next, Codemirror and PrimeReact, and is a playground/IDE for querying the Countries GraphQL API. It is localized into two languages and fully adaptive (up to 320 pixels), with responsive layout. In order to use the application, you need to log in and go to the main page. It consists of several parts, such as a documentation block with a description of the API schema, a block for creating a request with the ability to open several working tabs, a block for variables and headers, and finally a block for displaying the result in the JSON object format. ",
  "aboutCourseText": "The React course from Rolling Scopes School is a comprehensive program that provides the materials and tasks necessary to master this framework. Students study concepts such as components, state management and lifecycle methods, as well as advanced topics: React Router, Redux and hooks. The curriculum combines theory and practice with interesting tasks and a unique verification system. By the end of the course, students have enough experience in developing dynamic and scalable web applications using React to work as a junior developer. Learn more at course page ",
  "errorBoundary": "Sorry, something went wrong. Please reload the page or try in a few minutes later!"
}